Todo/app/controllers/tasks_controller.rb

SELECT `tasks`.* FROM `tasks`
---
  def index
    @task = Task.new
    @tasks = Task.all

INSERT INTO `tasks` (`name`, `memo`, `position`, `created_at`, `updated_at`) VALUES ('name', 'メモ', 3, '2023-08-26 15:26:08.080691', '2023-08-26 15:26:08.080691')
---
  def create
    @tasks = Task.all
    @task = Task.create(task_params)